<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Moyun Memory</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta property="og:type" content="website">
<meta property="og:title" content="Moyun Memory">
<meta property="og:url" content="http://yoursite.com/index.html">
<meta property="og:site_name" content="Moyun Memory">
<meta property="og:locale" content="zh-Hans">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Moyun Memory">
  
    <link rel="alternate" href="/atom.xml" title="Moyun Memory" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Moyun Memory</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">做牛B的产品，有追求的创造者</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main">
  
    <article id="post-学习笔记 ： 图解HTTP(五)" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2018/05/11/学习笔记 ： 图解HTTP(五)/" class="article-date">
  <time datetime="2018-05-11T02:10:04.000Z" itemprop="datePublished">2018-05-11</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <h1 id="&#x4E0E;HTTP&#x534F;&#x4F5C;&#x7684;Web&#x670D;&#x52A1;&#x5668;"><a href="#&#x4E0E;HTTP&#x534F;&#x4F5C;&#x7684;Web&#x670D;&#x52A1;&#x5668;" class="headerlink" title="&#x4E0E;HTTP&#x534F;&#x4F5C;&#x7684;Web&#x670D;&#x52A1;&#x5668;"></a>&#x4E0E;HTTP&#x534F;&#x4F5C;&#x7684;Web&#x670D;&#x52A1;&#x5668;</h1><h2 id="&#x7528;&#x5355;&#x53F0;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x57DF;&#x540D;"><a href="#&#x7528;&#x5355;&#x53F0;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x57DF;&#x540D;" class="headerlink" title="&#x7528;&#x5355;&#x53F0;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x57DF;&#x540D;"></a>&#x7528;&#x5355;&#x53F0;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x57DF;&#x540D;</h2><p>HTTP/1.1&#x89C4;&#x8303;&#x5141;&#x8BB8;&#x4E00;&#x53F0;HTTP&#x670D;&#x52A1;&#x5668;&#x642D;&#x5EFA;&#x591A;&#x4E2A;Web&#x7AD9;&#x70B9;&#xFF0C;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#xFF0C;&#x53CA;&#x65F6;&#x7269;&#x7406;&#x5C42;&#x9762;&#x53EA;&#x6709;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5047;&#x60F3;&#x6210;&#x6709;&#x591A;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>&#x6240;&#x6709;&#x5728;&#x76F8;&#x540C;&#x7684;IP&#x5730;&#x5740;&#x4E0B;&#xFF0C;&#x56E0;&#x4E3A;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x53EF;&#x4EE5;&#x5BC4;&#x5B58;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x4E3B;&#x673A;&#x540D;&#x548C;&#x57DF;&#x540D;&#x7684;Web&#x7F51;&#x7AD9;&#xFF0C;&#x5728;&#x53D1;&#x9001;HTTP&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x5728;Host&#x9996;&#x90E8;&#x5185;&#x5B8C;&#x6574;&#x6307;&#x5B9A;&#x4E3B;&#x673A;&#x540D;&#x6216;&#x57DF;&#x540D;&#x7684;URI&#x3002;</p>
<h2 id="&#x901A;&#x4FE1;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x7A0B;&#x5E8F;&#xFF1A;-&#x4EE3;&#x7406;&#x3001;&#x7F51;&#x5173;&#x3001;&#x96A7;&#x9053;"><a href="#&#x901A;&#x4FE1;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x7A0B;&#x5E8F;&#xFF1A;-&#x4EE3;&#x7406;&#x3001;&#x7F51;&#x5173;&#x3001;&#x96A7;&#x9053;" class="headerlink" title="&#x901A;&#x4FE1;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x7A0B;&#x5E8F;&#xFF1A; &#x4EE3;&#x7406;&#x3001;&#x7F51;&#x5173;&#x3001;&#x96A7;&#x9053;"></a>&#x901A;&#x4FE1;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x7A0B;&#x5E8F;&#xFF1A; &#x4EE3;&#x7406;&#x3001;&#x7F51;&#x5173;&#x3001;&#x96A7;&#x9053;</h2><p>HTTP&#x901A;&#x4FE1;&#x65F6;&#xFF0C;&#x9664;&#x5BA2;&#x6237;&#x7AEF;&#x5408;&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x7528;&#x4E8E;&#x901A;&#x4FE1;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6BD4;&#x5982;&#x4EE3;&#x7406;&#x3001;&#x7F51;&#x5173;&#x548C;&#x96A7;&#x9053;&#xFF0C;&#x53EF;&#x4EE5;&#x914D;&#x5408;&#x670D;&#x52A1;&#x5668;&#x5DE5;&#x4F5C;&#x3002;</p>
<ul>
<li><p>&#x4EE3;&#x7406;<br>&#x8868;&#x793A;&#x4E00;&#x79CD;&#x6709;&#x8F6C;&#x53D1;&#x529F;&#x80FD;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x626E;&#x6F14;&#x4F4D;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x201D;&#x4E2D;&#x95F4;&#x4EBA;&#x201D;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x63A5;&#x6536;&#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x5E76;&#x8F6C;&#x53D1;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x63A5;&#x53D7;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x5E76;&#x8F6C;&#x53D1;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>&#x5B83;&#x4E0D;&#x6539;&#x53D8;&#x8BF7;&#x6C42;URI&#xFF0C;&#x4F1A;&#x76F4;&#x63A5;&#x53D1;&#x9001;&#x7ED9;&#x524D;&#x65B9;&#x6E90;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x901A;&#x8FC7;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x7ECF;&#x8FC7;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x540E;&#x518D;&#x4F20;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>&#x5728;HTTP&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x7EA7;&#x8054;&#x591A;&#x53F0;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8F6C;&#x53D1;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x9644;&#x52A0;Via&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x4EE5;&#x6807;&#x8BB0;&#x51FA;&#x7ECF;&#x8FC7;&#x7684;&#x4E3B;&#x673A;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x7684;&#x7406;&#x7531;&#x6709;&#xFF1A; &#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x6280;&#x672F;&#x51CF;&#x5C11;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x7EC4;&#x7EC7;&#x5185;&#x90E8;&#x9488;&#x5BF9;&#x7279;&#x522B;&#x7F51;&#x7AD9;&#x7684;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF0C;&#x6765;&#x83B7;&#x53D6;&#x8BBF;&#x95EE;&#x65E5;&#x5FD7;&#x4E3A;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4EE3;&#x7406;&#x6309;&#x4E24;&#x79CD;&#x57FA;&#x51C6;&#x5206;&#x7C7B;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x548C;&#x662F;&#x5426;&#x4F1A;&#x4FEE;&#x6539;&#x62A5;&#x6587;&#x3002;</p>
<ul>
<li>&#x7F13;&#x5B58;&#x4EE3;&#x7406;&#xFF1A; &#x4EE3;&#x7406;&#x8F6C;&#x53D1;&#x54CD;&#x5E94;&#x65F6;&#xFF0C;&#x7F13;&#x5B58;&#x4EE3;&#x7406;&#x4F1A;&#x9884;&#x5148;&#x5C06;&#x8D44;&#x6E90;&#x7684;&#x526F;&#x672C;&#x4FDD;&#x5B58;&#x5728;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x5F53;&#x4EE3;&#x7406;&#x518D;&#x6B21;&#x63A5;&#x53D7;&#x5230;&#x5BF9;&#x76F8;&#x540C;&#x8D44;&#x6E90;&#x7684;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x4ECE;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x90A3;&#x91CC;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x4E4B;&#x524D;&#x7F13;&#x5B58;&#x7684;&#x8D44;&#x6E90;&#x4F5C;&#x4E3A;&#x54CD;&#x5E94;&#x8FD4;&#x56DE;&#x3002;</li>
<li>&#x900F;&#x660E;&#x4EE3;&#x7406;&#xFF1A; &#x8F6C;&#x53D1;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x65F6;&#xFF0C;&#x4E0D;&#x5BF9;&#x62A5;&#x6587;&#x505A;&#x4EFB;&#x4F55;&#x52A0;&#x5DE5;&#x7684;&#x4EE3;&#x7406;&#x88AB;&#x79F0;&#x4E3A;&#x900F;&#x660E;&#x4EE3;&#x7406;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x5BF9;&#x62A5;&#x6587;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x52A0;&#x5DE5;&#x7684;&#x4EE3;&#x7406;&#x88AB;&#x79F0;&#x4E3A;&#x975E;&#x900F;&#x660E;&#x4EE3;&#x7406;&#x3002;</li>
</ul>
</li>
<li><p>&#x7F51;&#x5173;<br>&#x8868;&#x793A;&#x8F6C;&#x53D1;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5668;&#x901A;&#x4FE1;&#x6570;&#x636E;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x63A5;&#x6536;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x6765;&#x7684;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5B83;&#x5C31;&#x50CF;&#x81EA;&#x5DF1;&#x62E5;&#x6709;&#x8D44;&#x6E90;&#x7684;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x4E00;&#x6837;&#x5BF9;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x6709;&#x65F6;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x80FD;&#x90FD;&#x4E0D;&#x4F1A;&#x5BDF;&#x89C9;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x901A;&#x4FE1;&#x76EE;&#x6807;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x5173;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4EE3;&#x7406;&#x800C;&#x8A00;&#xFF0C;&#x7F51;&#x5173;&#x80FD;&#x4F7F;&#x901A;&#x4FE1;&#x7EBF;&#x8DEF;&#x4E0A;&#x7684;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x975E;HTTP&#x534F;&#x8BAE;&#x670D;&#x52A1;&#x3002;&#x4F7F;&#x7528;&#x7F51;&#x5173;&#x80FD;&#x63D0;&#x9AD8;&#x901A;&#x4FE1;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x5408;&#x7F51;&#x5173;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x7EBF;&#x8DEF;&#x4E0A;&#x52A0;&#x5BC6;&#x4EE5;&#x786E;&#x4FDD;&#x8FDE;&#x63A5;&#x7684;&#x5B89;&#x5168;&#x3002; &#x6BD4;&#x5982;&#xFF0C;&#x7F51;&#x5173;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F7F;&#x7528;SQL&#x8BED;&#x53E5;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x3002;</p>
</li>
<li><p>&#x96A7;&#x9053;<br>&#x8868;&#x793A;&#x5728;&#x76F8;&#x9694;&#x5F88;&#x8FDC;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5408;&#x670D;&#x52A1;&#x5668;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x4E2D;&#x8F6C;&#xFF0C;&#x5E76;&#x4FDD;&#x6301;&#x53CC;&#x65B9;&#x901A;&#x4FE1;&#x8FDE;&#x63A5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5B83;&#x53EF;&#x4EE5;&#x6309;&#x8981;&#x6C42;&#x5EFA;&#x7ACB;&#x8D77;&#x4E00;&#x6761;&#x4E0E;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5668;&#x7684;&#x901A;&#x4FE1;&#x8DEF;&#x7EBF;&#xFF0C;&#x5C4A;&#x65F6;&#x4F7F;&#x7528;SSL&#x7B49;&#x52A0;&#x5BC6;&#x624B;&#x6BB5;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x786E;&#x4FDD;&#x5BA2;&#x6237;&#x7AEF;&#x80FD;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x5B89;&#x5168;&#x7684;&#x901A;&#x4FE1;&#x3002;</p>
<p>&#x96A7;&#x9053;&#x672C;&#x8EAB;&#x4E0D;&#x4F1A;&#x53BB;&#x89E3;&#x6790;HTTP&#x8BF7;&#x6C42;&#x3002;&#x8BF7;&#x6C42;&#x4FDD;&#x6301;&#x539F;&#x6837;&#x4E2D;&#x8F6C;&#x7ED9;&#x4E4B;&#x540E;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5728;&#x901A;&#x4FE1;&#x53CC;&#x65B9;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x65F6;&#x7ED3;&#x675F;&#x3002;</p>
<h2 id="&#x4FDD;&#x5B58;&#x8D44;&#x6E90;&#x7684;&#x7F13;&#x5B58;"><a href="#&#x4FDD;&#x5B58;&#x8D44;&#x6E90;&#x7684;&#x7F13;&#x5B58;" class="headerlink" title="&#x4FDD;&#x5B58;&#x8D44;&#x6E90;&#x7684;&#x7F13;&#x5B58;"></a>&#x4FDD;&#x5B58;&#x8D44;&#x6E90;&#x7684;&#x7F13;&#x5B58;</h2><p>&#x7F13;&#x5B58;&#x8868;&#x793A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x6216;&#x5BA2;&#x6237;&#x7AEF;&#x672C;&#x5730;&#x7684;&#x78C1;&#x76D8;&#x5185;&#x4FDD;&#x5B58;&#x7684;&#x8D44;&#x6E90;&#x526F;&#x672C;&#x3002;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5BF9;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x8282;&#x7701;&#x901A;&#x4FE1;&#x6D41;&#x91CF;&#x548C;&#x901A;&#x4FE1;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x662F;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x5F53;&#x4EE3;&#x7406;&#x8F6C;&#x53D1;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#xFF0C;&#x4F1A;&#x4FDD;&#x5B58;&#x4E00;&#x4EFD;&#x8D44;&#x6E90;&#x7684;&#x526F;&#x672C;&#x3002;</p>
<h3 id="&#x7F13;&#x5B58;&#x7684;&#x6709;&#x6548;&#x671F;"><a href="#&#x7F13;&#x5B58;&#x7684;&#x6709;&#x6548;&#x671F;" class="headerlink" title="&#x7F13;&#x5B58;&#x7684;&#x6709;&#x6548;&#x671F;"></a>&#x7F13;&#x5B58;&#x7684;&#x6709;&#x6548;&#x671F;</h3><p>&#x5373;&#x4F7F;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x6709;&#x7F13;&#x5B58;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6BCF;&#x6B21;&#x90FD;&#x4F1A;&#x8FD4;&#x56DE;&#x5BF9;&#x540C;&#x8D44;&#x6E90;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x56E0;&#x4E3A;&#x7F13;&#x5B58;&#x8D44;&#x6E90;&#x5177;&#x6709;&#x6709;&#x6548;&#x6027;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x8D44;&#x6E90;&#x66F4;&#x65B0;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x7528;&#x4E0D;&#x53D8;&#x7684;&#x7F13;&#x5B58;&#xFF0C;&#x90A3;&#x903B;&#x8F91;&#x4E0A;&#x5C31;&#x6709;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x5982;&#x679C;&#x5224;&#x65AD;&#x7F13;&#x5B58;&#x5931;&#x6548;&#xFF0C;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x518D;&#x6B21;&#x4ECE;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x83B7;&#x53D6;&#x201D;&#x65B0;&#x201D;&#x8D44;&#x6E90;&#x3002;</p>
<h3 id="&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7F13;&#x5B58;"><a href="#&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7F13;&#x5B58;" class="headerlink" title="&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7F13;&#x5B58;"></a>&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7F13;&#x5B58;</h3><p>&#x7F13;&#x5B58;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x5185;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x3002;&#x5408;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x76F8;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x5224;&#x65AD;&#x7F13;&#x5B58;&#x8FC7;&#x671F;&#x540E;&#xFF0C;&#x4F1A;&#x518D;&#x6B21;&#x50CF;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x786E;&#x8BA4;&#x8D44;&#x6E90;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002; </p>
</li>
</ul>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2018/05/11/学习笔记 ： 图解HTTP(五)/" data-id="cjh4m8hou000nfcv4bs67oavd" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  
    <article id="post-学习笔记 ： 图解HTTP(四)" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2018/05/10/学习笔记 ： 图解HTTP(四)/" class="article-date">
  <time datetime="2018-05-10T01:55:25.000Z" itemprop="datePublished">2018-05-10</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <h1 id="&#x5B66;&#x4E60;&#x7B14;&#x8BB0;-&#xFF1A;-&#x56FE;&#x89E3;HTTP-&#x56DB;-&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x7684;HTTP&#x72B6;&#x6001;&#x7801;"><a href="#&#x5B66;&#x4E60;&#x7B14;&#x8BB0;-&#xFF1A;-&#x56FE;&#x89E3;HTTP-&#x56DB;-&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x7684;HTTP&#x72B6;&#x6001;&#x7801;" class="headerlink" title="&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x56DB;) &#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x7684;HTTP&#x72B6;&#x6001;&#x7801;"></a>&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x56DB;) &#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x7684;HTTP&#x72B6;&#x6001;&#x7801;</h1><h2 id="&#x72B6;&#x6001;&#x7801;&#x544A;&#x77E5;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FD4;&#x56DE;&#x7684;&#x8BF7;&#x6C42;&#x7ED3;&#x679C;"><a href="#&#x72B6;&#x6001;&#x7801;&#x544A;&#x77E5;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FD4;&#x56DE;&#x7684;&#x8BF7;&#x6C42;&#x7ED3;&#x679C;" class="headerlink" title="&#x72B6;&#x6001;&#x7801;&#x544A;&#x77E5;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FD4;&#x56DE;&#x7684;&#x8BF7;&#x6C42;&#x7ED3;&#x679C;"></a>&#x72B6;&#x6001;&#x7801;&#x544A;&#x77E5;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FD4;&#x56DE;&#x7684;&#x8BF7;&#x6C42;&#x7ED3;&#x679C;</h2><p>HTTP&#x72B6;&#x6001;&#x7801;&#x8D1F;&#x8D23;&#x5BA2;&#x6237;&#x7AEF;HTTP&#x8BF7;&#x6C42;&#x7684;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3001;&#x6807;&#x8BB0;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x5904;&#x7406;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x3001;&#x901A;&#x77E5;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x7B49;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x72B6;&#x6001;&#x7801;&#x5982;200 OK&#xFF0C;&#x4EE5;3&#x4F4D;&#x6570;&#x5B57;&#x548C;&#x539F;&#x56E0;&#x77ED;&#x8BED;&#x7EC4;&#x6210;&#xFF0C; &#x54CD;&#x5E94;&#x7C7B;&#x522B;&#x6709;&#x4EE5;&#x4E0B;5&#x79CD;&#x3002;</p>
<p><img src="/2018/05/10/&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x56DB;)/HTTP4-1.jpeg" alt=""></p>
<p>&#x53EA;&#x8981;&#x9075;&#x5B88;&#x72B6;&#x6001;&#x7801;&#x7C7B;&#x522B;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x53CA;&#x65F6;&#x6539;&#x53D8;RFC2616&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x72B6;&#x6001;&#x7801;&#xFF0C;&#x6216;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x81EA;&#x884C;&#x521B;&#x5EFA;&#x72B6;&#x6001;&#x7801;&#x90FD;&#x6CA1;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="2XX&#x6210;&#x529F;"><a href="#2XX&#x6210;&#x529F;" class="headerlink" title="2XX&#x6210;&#x529F;"></a>2XX&#x6210;&#x529F;</h2><p>3&#x4F4D;&#x6570;&#x5B57;&#x4EE5;2&#x5F00;&#x5934;&#x7684;&#x54CD;&#x5E94;&#x7ED3;&#x679C;&#x8868;&#x660E;&#x8BF7;&#x6C42;&#x88AB;&#x6B63;&#x5E38;&#x5904;&#x7406;&#x4E86;&#x3002;</p>
<h3 id="200-0K"><a href="#200-0K" class="headerlink" title="200 0K"></a>200 0K</h3><p>&#x8868;&#x793A;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x6765;&#x7684;&#x8BF7;&#x6C42;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x88AB;&#x6B63;&#x5E38;&#x5904;&#x7406;&#x4E86;&#x3002;</p>
<h3 id="204"><a href="#204" class="headerlink" title="204"></a>204</h3><p>&#x8868;&#x793A;&#x670D;&#x52A1;i&#x63A5;&#x6536;&#x7684;&#x8BF7;&#x6C42;&#x5DF2;&#x6210;&#x529F;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x5728;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x5B9E;&#x4F53;&#x7684;&#x4E3B;&#x9898;&#x90E8;&#x5206;&#x3002;&#x53E6;&#x5916;&#x4E5F;&#x4E0D;&#x5141;&#x8BB8;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x5B9E;&#x4F53;&#x7684;&#x4E3B;&#x4F53;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x5728;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x5F80;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x9700;&#x8981;&#x53D1;&#x9001;&#x65B0;&#x4FE1;&#x606F;&#x5185;&#x5BB9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="206"><a href="#206" class="headerlink" title="206"></a>206</h3><p>&#x8868;&#x793A;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x4E86;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;&#x670D;&#x52A1;&#x5668;&#x6210;&#x529F;&#x6267;&#x884C;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x7684;GET&#x8BF7;&#x6C42;&#x3002;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x4E2D;&#x5305;&#x542B;&#x7531;Content-Range&#x6307;&#x5B9A;&#x8303;&#x56F4;&#x7684;&#x5B9E;&#x4F53;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="3XX&#x91CD;&#x5B9A;&#x5411;"><a href="#3XX&#x91CD;&#x5B9A;&#x5411;" class="headerlink" title="3XX&#x91CD;&#x5B9A;&#x5411;"></a>3XX&#x91CD;&#x5B9A;&#x5411;</h2><p>3&#x4F4D;&#x6570;&#x5B57;&#x4EE5;3&#x5F00;&#x5934;&#x7684;&#x54CD;&#x5E94;&#x7ED3;&#x679C;&#x8868;&#x793A;&#x6D4F;&#x89C8;&#x5668;&#x9700;&#x8981;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x5904;&#x7406;&#x6765;&#x6B63;&#x786E;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x3002;</p>
<h3 id="301"><a href="#301" class="headerlink" title="301"></a>301</h3><p>&#x8868;&#x793A;&#x6C38;&#x4E45;&#x91CD;&#x5B9A;&#x5411;&#x3002; &#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x5DF2;&#x88AB;&#x5206;&#x914D;&#x4E86;&#x65B0;&#x7684;URI&#xFF0C;&#x4EE5;&#x540E;&#x5E94;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x73B0;&#x5728;&#x6240;&#x6307;&#x7684;URI&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x628A;&#x8D44;&#x6E90;&#x5BF9;&#x5E94;&#x7684;URI&#x4FDD;&#x5B58;&#x4E3A;&#x4E66;&#x7B7E;&#x4E86;&#xFF0C;&#x8FD9;&#x65F6;&#x5E94;&#x8BE5;&#x6309;Location&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x63D0;&#x793A;&#x7684;URI&#x91CD;&#x65B0;&#x4FDD;&#x5B58;&#x3002;</p>
<h3 id="302"><a href="#302" class="headerlink" title="302"></a>302</h3><p>&#x8868;&#x793A;&#x4E34;&#x65F6;&#x6027;&#x91CD;&#x5B9A;&#x5411;&#x3002; &#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x5DF2;&#x88AB;&#x5206;&#x914D;&#x4E86;&#x65B0;&#x7684;URI&#xFF0C;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x80FD;&#x4F7F;&#x7528;&#x65B0;&#x7684;URI&#x8BBF;&#x95EE;&#x3002;</p>
<h3 id="303"><a href="#303" class="headerlink" title="303"></a>303</h3><p>&#x8868;&#x793A;&#x7531;&#x4E8E;&#x8BF7;&#x6C42;&#x5BF9;&#x5E94;&#x7684;&#x8D44;&#x6E90;&#x5B58;&#x5728;&#x7740;&#x53E6;&#x4E00;&#x4E2A;URI,&#x5E94;&#x4F7F;&#x7528;GET&#x65B9;&#x6CD5;&#x5B9A;&#x5411;&#x83B7;&#x53D6;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x4E0E;302&#x7684;&#x533A;&#x522B;&#x662F;&#xFF0C;303&#x660E;&#x786E;&#x8868;&#x793A;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x8BE5;&#x91C7;&#x7528;GET&#x65B9;&#x6CD5;&#x83B7;&#x53D6;&#x8D44;&#x6E90;&#x3002;</p>
<h3 id="304"><a href="#304" class="headerlink" title="304"></a>304</h3><p>&#x8868;&#x793A;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x9644;&#x5E26;&#x6761;&#x4EF6;&#x7684;&#x8BF7;&#x6C42;&#x65F6;&#xFF08;&#x91C7;&#x7528;GET&#x65B9;&#x6CD5;&#x7684;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x4E2D;&#x5305;&#x542B;If-Match,If-Modified-Since,If-None-Match,If-Range,If-nmodified-Since&#x4E2D;&#x4EFB;&#x4E00;&#x9996;&#x90E8;&#xFF09;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5141;&#x8BB8;&#x8BF7;&#x6C42;&#x8BBF;&#x95EE;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x672A;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x3002; 304&#x72B6;&#x6001;&#x7801;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x54CD;&#x5E94;&#x7684;&#x4E3B;&#x4F53;&#x90E8;&#x5206;&#x3002; 304&#x867D;&#x7136;&#x88AB;&#x5212;&#x5206;&#x5728;3XX&#x7C7B;&#x522B;&#x4E2D;&#xFF0C;&#x4F46;&#x5408;&#x91CD;&#x5B9A;&#x5411;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#x3002;</p>
<h3 id="307"><a href="#307" class="headerlink" title="307"></a>307</h3><p>&#x8868;&#x793A;&#x4E34;&#x65F6;&#x6027;&#x91CD;&#x5B9A;&#x5411;&#x3002; &#x5C3D;&#x7BA1;302&#x6807;&#x51C6;&#x7981;&#x6B62;POST&#x53D8;&#x6362;&#x6210;GET&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x65F6;&#x5927;&#x5BB6;&#x5E76;&#x4E0D;&#x9075;&#x5B88;&#x3002; 307&#x4F1A;&#x9075;&#x7167;&#x6D4F;&#x89C8;&#x5668;&#x6807;&#x51C6;&#xFF0C;&#x4E0D;&#x4F1A;&#x4ECE;POST&#x53D8;&#x6210;GET&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5904;&#x7406;&#x54CD;&#x5E94;&#x65F6;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6BCF;&#x79CD;&#x6D4F;&#x89C8;&#x5668;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<h2 id="4XX"><a href="#4XX" class="headerlink" title="4XX"></a>4XX</h2><p>3&#x4F4D;&#x6570;&#x5B57;&#x4EE5;4&#x5F00;&#x5934;&#x7684;&#x54CD;&#x5E94;&#x7ED3;&#x679C;&#x8868;&#x793A;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x9519;&#x8BEF;&#x3002;</p>
<h3 id="400"><a href="#400" class="headerlink" title="400"></a>400</h3><p>&#x8868;&#x793A;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x5B58;&#x5728;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x3002;&#x5F53;&#x9519;&#x8BEF;&#x53D1;&#x751F;&#xFF0C;&#x9700;&#x4FEE;&#x6539;&#x8BF7;&#x6C42;&#x7684;&#x5185;&#x5BB9;&#x540E;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x50CF;200 OK&#x4E00;&#x6837;&#x5BF9;&#x5F85;&#x8BE5;&#x72B6;&#x6001;&#x7801;&#x3002;</p>
<h3 id="401"><a href="#401" class="headerlink" title="401"></a>401</h3><p>&#x8868;&#x793A;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x9700;&#x8981;&#x6709;&#x901A;&#x8FC7;HTTP&#x8BA4;&#x8BC1;&#x7684;&#x8BA4;&#x8BC1;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x4E4B;&#x524D;&#x5DF2;&#x8FDB;&#x884C;&#x8FC7;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x8868;&#x793A;&#x7528;&#x6237;&#x8BA4;&#x8BC1;&#x5931;&#x8D25;&#x3002;</p>
<h3 id="403"><a href="#403" class="headerlink" title="403"></a>403</h3><p>&#x8868;&#x793A;&#x5BF9;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;&#x88AB;&#x670D;&#x52A1;&#x5668;&#x62D2;&#x7EDD;&#x4E86;&#x3002; &#x672A;&#x83B7;&#x53D6;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x8BBF;&#x95EE;&#x6388;&#x6743;&#xFF0C;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x51FA;&#x73B0;&#x67D0;&#x4E9B;&#x95EE;&#x9898;&#x7B49;&#x5217;&#x4E3E;&#x7684;&#x60C5;&#x51B5;&#x90FD;&#x53EF;&#x80FD;&#x662F;&#x53D1;&#x751F;403&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h3 id="404"><a href="#404" class="headerlink" title="404"></a>404</h3><p>&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x8BF7;&#x6C42;&#x7684;&#x8D44;&#x6E90;&#x3002; &#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x62D2;&#x7EDD;&#x8BF7;&#x6C42;&#x4E14;&#x4E0D;&#x50CF;&#x8BF4;&#x660E;&#x7406;&#x7531;&#x65F6;&#x4F7F;&#x7528;&#x3002;</p>
<h2 id="5XX"><a href="#5XX" class="headerlink" title="5XX"></a>5XX</h2><p>3&#x4F4D;&#x6570;&#x5B57;&#x4EE5;5&#x5F00;&#x5934;&#x7684;&#x54CD;&#x5E94;&#x7ED3;&#x679C;&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x672C;&#x8EAB;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x3002;</p>
<h3 id="500"><a href="#500" class="headerlink" title="500"></a>500</h3><p>&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5728;&#x6267;&#x884C;&#x8BF7;&#x6C42;&#x65F6;&#x53D1;&#x751F;&#x4E86;&#x9519;&#x8BEF;&#x3002;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x662F;Web&#x5E94;&#x7528;&#x5B58;&#x5728;&#x7684;bug&#x6216;&#x67D0;&#x4E9B;&#x4E34;&#x65F6;&#x7684;&#x6545;&#x969C;&#x3002;</p>
<h3 id="503"><a href="#503" class="headerlink" title="503"></a>503</h3><p>&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x6682;&#x65F6;&#x5904;&#x7406;&#x8D85;&#x8D1F;&#x8F7D;&#x6216;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x505C;&#x673A;&#x7EF4;&#x62A4;&#xFF0C;&#x73B0;&#x5728;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x3002;&#x5982;&#x679C;&#x4E8B;&#x5148;&#x5F97;&#x77E5;&#x63A5;&#x89E6;&#x4EE5;&#x4E0A;&#x72B6;&#x51B5;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6700;&#x597D;&#x5199;&#x5165;Retry-After&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x518D;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<h2 id="&#x72B6;&#x6001;&#x7801;&#x548C;&#x72B6;&#x51B5;&#x7684;&#x4E0D;&#x4E00;&#x81F4;"><a href="#&#x72B6;&#x6001;&#x7801;&#x548C;&#x72B6;&#x51B5;&#x7684;&#x4E0D;&#x4E00;&#x81F4;" class="headerlink" title="&#x72B6;&#x6001;&#x7801;&#x548C;&#x72B6;&#x51B5;&#x7684;&#x4E0D;&#x4E00;&#x81F4;"></a>&#x72B6;&#x6001;&#x7801;&#x548C;&#x72B6;&#x51B5;&#x7684;&#x4E0D;&#x4E00;&#x81F4;</h2><p>&#x4E0D;&#x5C11;&#x8FD4;&#x56DE;&#x7684;&#x72B6;&#x6001;&#x7801;&#x54CD;&#x5E94;&#x90FD;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x5BDF;&#x89C9;&#x4E0D;&#x5230;&#x8FD9;&#x70B9;&#x3002;&#x6BD4;&#x5982;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x72B6;&#x6001;&#x7801;&#x4F9D;&#x7136;&#x8FD4;&#x56DE;200 OK&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x7ECF;&#x5E38;&#x9047;&#x5230;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2018/05/10/学习笔记 ： 图解HTTP(四)/" data-id="cjh4m8hox000qfcv4rrh4kclp" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  
    <article id="post-学习笔记 ： 图解HTTP(三)" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2018/05/09/学习笔记 ： 图解HTTP(三)/" class="article-date">
  <time datetime="2018-05-09T02:37:59.000Z" itemprop="datePublished">2018-05-09</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>#&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP&#x4E09;&#x3001;HTTP&#x62A5;&#x6587;&#x5185;&#x7684;HTTP&#x4FE1;&#x606F;</p>
<h2 id="HTTP&#x62A5;&#x6587;"><a href="#HTTP&#x62A5;&#x6587;" class="headerlink" title="HTTP&#x62A5;&#x6587;"></a>HTTP&#x62A5;&#x6587;</h2><p>&#x7528;&#x4E8E;HTTP&#x534F;&#x8BAE;&#x4EA4;&#x4E92;&#x7684;&#x4FE1;&#x606F;&#x88AB;&#x79F0;&#x4E3A;HTTP&#x62A5;&#x6587;&#x3002;&#x8BF7;&#x6C42;&#x7AEF;&#x7684;HTTP&#x62A5;&#x6587;&#x53EB;&#x505A;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#xFF0C;&#x54CD;&#x5E94;&#x7AEF;&#x7684;&#x53EB;&#x505A;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x3002;</p>
<p>HTTP&#x62A5;&#x6587;&#x5927;&#x81F4;&#x53EF;&#x5206;&#x4E3A;&#x62A5;&#x6587;&#x9996;&#x90E8;&#x5408;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x4E24;&#x5757;&#x3002;</p>
<p>&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x548C;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x7684;&#x9996;&#x90E8;&#x5185;&#x5BB9;&#x7531;&#x4EE5;&#x4E0B;&#x6570;&#x636E;&#x7EC4;&#x6210;&#xFF1A;</p>
<ul>
<li>&#x8BF7;&#x6C42;&#x884C; &#xFF1A; &#x5305;&#x542B;&#x7528;&#x4E8E;&#x8BF7;&#x6C42;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BF7;&#x6C42;URI&#x548C;HTTP&#x7248;&#x672C;</li>
<li>&#x72B6;&#x6001;&#x884C; &#xFF1A; &#x5305;&#x542B;&#x8868;&#x660E;&#x54CD;&#x5E94;&#x7ED3;&#x679C;&#x7684;&#x72B6;&#x6001;&#x7801;&#xFF0C;&#x539F;&#x56E0;&#x77ED;&#x8BED;&#x548C;HTTP&#x7248;&#x672C;</li>
<li>&#x9996;&#x90E8;&#x5B57;&#x6BB5; &#xFF1A; &#x5305;&#x542B;&#x8868;&#x793A;&#x8BF7;&#x6C42;&#x5408;&#x54CD;&#x5E94;&#x7684;&#x5404;&#x79CD;&#x6761;&#x4EF6;&#x5408;&#x5C5E;&#x6027;&#x7684;&#x5404;&#x7C7B;&#x9996;&#x90E8;&#xFF08;&#x901A;&#x7528;&#x9996;&#x90E8;&#x3001;&#x8BF7;&#x6C42;&#x9996;&#x90E8;&#x3001;&#x54CD;&#x5E94;&#x9996;&#x90E8;&#x3001;&#x5B9E;&#x4F53;&#x9996;&#x90E8;&#xFF09;</li>
<li>&#x5176;&#x4ED6; &#xFF1A;&#x53EF;&#x80FD;&#x5305;&#x542B;HTTP&#x7684;RFC&#x91CC;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x9996;&#x90E8;&#xFF08;cookie&#x7B49;&#xFF09;<br><img src="/2018/05/09/&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x4E09;)/HTTP3-1.JPEG" alt=""></li>
</ul>
<h2 id="&#x7F16;&#x7801;&#x63D0;&#x5347;&#x4F20;&#x8F93;&#x901F;&#x7387;"><a href="#&#x7F16;&#x7801;&#x63D0;&#x5347;&#x4F20;&#x8F93;&#x901F;&#x7387;" class="headerlink" title="&#x7F16;&#x7801;&#x63D0;&#x5347;&#x4F20;&#x8F93;&#x901F;&#x7387;"></a>&#x7F16;&#x7801;&#x63D0;&#x5347;&#x4F20;&#x8F93;&#x901F;&#x7387;</h2><p>HTTP&#x5728;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x65F6;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x6570;&#x636E;&#x539F;&#x8C8C;&#x76F4;&#x63A5;&#x4F20;&#x8F93;&#xFF0C;&#x4F46;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x901A;&#x8FC7;&#x7F16;&#x7801;&#x63D0;&#x5347;&#x4F20;&#x8F93;&#x901F;&#x7387;&#x3002;&#x901A;&#x8FC7;&#x5728;&#x4F20;&#x8F93;&#x65F6;&#x7F16;&#x7801;&#xFF0C;&#x80FD;&#x6709;&#x6548;&#x5730;&#x5904;&#x7406;&#x5927;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x8BF7;&#x6C42;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7F16;&#x7801;&#x7684;&#x64CD;&#x4F5C;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x6D88;&#x8017;&#x66F4;&#x591A;&#x7684;CPI&#x8D44;&#x6E90;&#x3002;</p>
<h4 id="&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x5408;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x7684;&#x5DEE;&#x5F02;"><a href="#&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x5408;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x7684;&#x5DEE;&#x5F02;" class="headerlink" title="&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x5408;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x7684;&#x5DEE;&#x5F02;"></a>&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x5408;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x7684;&#x5DEE;&#x5F02;</h4><ul>
<li>&#x62A5;&#x6587; &#xFF1A; HTTP&#x901A;&#x4FE1;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x7531;8&#x4F4D;&#x7EC4;&#x5B57;&#x8282;&#x6D41;&#x7EC4;&#x6210;&#xFF0C;&#x901A;&#x8FC7;HTTP&#x901A;&#x4FE1;&#x4F20;&#x8F93;&#x3002;</li>
<li>&#x5B9E;&#x4F53; &#xFF1A; &#x4F5C;&#x4E3A;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x7684;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x6570;&#x636E;&#x88AB;&#x4F20;&#x8F93;&#xFF0C;&#x5176;&#x5185;&#x5BB9;&#x7531;&#x5B9E;&#x4F53;&#x9996;&#x90E8;&#x548C;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x7EC4;&#x6210;</li>
</ul>
<p>HTTP&#x62A5;&#x6587;&#x7684;&#x4E3B;&#x4F53;&#x7528;&#x4E8E;&#x4F20;&#x8F93;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x7684;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;<br>&#x901A;&#x5E38;&#xFF0C;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x7B49;&#x4E8E;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x4F20;&#x8F93;&#x4E2D;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x7684;&#x5185;&#x5BB9;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x624D;&#x5BFC;&#x81F4;&#x5B83;&#x548C;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x4EA7;&#x751F;&#x5DEE;&#x5F02;&#x3002;</p>
<h4 id="&#x538B;&#x7F29;&#x4F20;&#x8F93;&#x7684;&#x5185;&#x5BB9;&#x7F16;&#x7801;"><a href="#&#x538B;&#x7F29;&#x4F20;&#x8F93;&#x7684;&#x5185;&#x5BB9;&#x7F16;&#x7801;" class="headerlink" title="&#x538B;&#x7F29;&#x4F20;&#x8F93;&#x7684;&#x5185;&#x5BB9;&#x7F16;&#x7801;"></a>&#x538B;&#x7F29;&#x4F20;&#x8F93;&#x7684;&#x5185;&#x5BB9;&#x7F16;&#x7801;</h4><p>&#x5411;&#x5F85;&#x53D1;&#x9001;&#x90AE;&#x4EF6;&#x5185;&#x589E;&#x52A0;&#x9644;&#x4EF6;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x90AE;&#x4EF6;&#x5BB9;&#x91CF;&#x53D8;&#x5C0F;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5148;&#x7528;ZIP&#x538B;&#x7F29;&#x6587;&#x4EF6;&#x4E4B;&#x540E;&#x518D;&#x6DFB;&#x52A0;&#x9644;&#x4EF6;&#x53D1;&#x9001;&#x3002;HTTP&#x534F;&#x8BAE;&#x4E2D;&#x6709;&#x4E00;&#x79CD;&#x88AB;&#x79F0;&#x4E3A;&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x7684;&#x529F;&#x80FD;&#x4E5F;&#x80FD;&#x8FDB;&#x884C;&#x7C7B;&#x4F3C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x6307;&#x660E;&#x5E94;&#x7528;&#x5728;&#x5B9E;&#x4F53;&#x5185;&#x5BB9;&#x4E0A;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF0C;&#x5E76;&#x4FDD;&#x6301;&#x5B9E;&#x4F53;&#x4FE1;&#x606F;&#x539F;&#x6837;&#x538B;&#x7F29;&#x3002;&#x5185;&#x5BB9;&#x7F16;&#x7801;&#x540E;&#x7684;&#x5B9E;&#x4F53;&#x7531;&#x5BA2;&#x6237;&#x7B97;&#x63A5;&#x6536;&#x5E76;&#x8D1F;&#x8D23;&#x89E3;&#x7801;&#x3002; &#x5E38;&#x7528;&#x7684;&#x6709;&#xFF1A;</p>
<ul>
<li>gzip (GNU zip)</li>
<li>compress (UNIX&#x7CFB;&#x7EDF;&#x7684;&#x6807;&#x51C6;&#x538B;&#x7F29;)</li>
<li>deflate (zlib)</li>
<li>identity (&#x4E0D;&#x8FDB;&#x884C;&#x7F16;&#x7801;)</li>
</ul>
<h4 id="&#x5206;&#x5272;&#x53D1;&#x9001;&#x7684;&#x5206;&#x5757;&#x4F20;&#x8F93;&#x7F16;&#x7801;"><a href="#&#x5206;&#x5272;&#x53D1;&#x9001;&#x7684;&#x5206;&#x5757;&#x4F20;&#x8F93;&#x7F16;&#x7801;" class="headerlink" title="&#x5206;&#x5272;&#x53D1;&#x9001;&#x7684;&#x5206;&#x5757;&#x4F20;&#x8F93;&#x7F16;&#x7801;"></a>&#x5206;&#x5272;&#x53D1;&#x9001;&#x7684;&#x5206;&#x5757;&#x4F20;&#x8F93;&#x7F16;&#x7801;</h4><p>&#x5728;HTTP&#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BF7;&#x6C42;&#x7684;&#x7F16;&#x7801;&#x5B9E;&#x4F53;&#x8D44;&#x6E90;&#x5C1A;&#x672A;&#x5168;&#x90E8;&#x4F20;&#x8F93;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x65E0;&#x6CD5;&#x663E;&#x793A;&#x8BF7;&#x6C42;&#x9875;&#x9762;&#x3002;&#x5728;&#x4F20;&#x8F93;&#x5927;&#x5BB9;&#x91CF;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x628A;&#x6570;&#x636E;&#x5206;&#x5272;&#x6210;&#x591A;&#x5757;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x9010;&#x6B65;&#x663E;&#x793A;&#x9875;&#x9762;&#x3002; &#x8FD9;&#x79CD;&#x628A;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x5206;&#x5757;&#x7684;&#x529F;&#x80FD;&#x79F0;&#x4E3A;&#x5206;&#x5757;&#x4F20;&#x8F93;&#x7F16;&#x7801;&#x3002;&#x4F7F;&#x7528;&#x5206;&#x5757;&#x4F20;&#x8F93;&#x7F16;&#x7801;&#x7684;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x4F1A;&#x7531;&#x63A5;&#x53D7;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x8D1F;&#x8D23;&#x89E3;&#x7801;&#xFF0C;&#x6062;&#x590D;&#x5230;&#x7F16;&#x7801;&#x524D;&#x7684;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x3002;</p>
<h4 id="&#x5206;&#x9001;&#x591A;&#x79CD;&#x6570;&#x636E;&#x7684;&#x591A;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x96C6;&#x5408;"><a href="#&#x5206;&#x9001;&#x591A;&#x79CD;&#x6570;&#x636E;&#x7684;&#x591A;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x96C6;&#x5408;" class="headerlink" title="&#x5206;&#x9001;&#x591A;&#x79CD;&#x6570;&#x636E;&#x7684;&#x591A;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x96C6;&#x5408;"></a>&#x5206;&#x9001;&#x591A;&#x79CD;&#x6570;&#x636E;&#x7684;&#x591A;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x96C6;&#x5408;</h4><p>MIME(Multipurpose Internet Mail Extensions,&#x591A;&#x7528;&#x9014;&#x56E0;&#x7279;&#x7F51;&#x90AE;&#x4EF6;&#x6269;&#x5C55;)&#xFF0C;&#x5141;&#x8BB8;&#x5904;&#x7406;&#x6587;&#x672C;&#x3001;&#x56FE;&#x7247;&#x3001;&#x89C6;&#x9891;&#x7B49;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x56FE;&#x7247;&#x7B49;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x4EE5;ASCII&#x7801;&#x5B57;&#x7B26;&#x4E32;&#x7F16;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x6307;&#x660E;&#xFF0C;&#x5C31;&#x662F;&#x5229;&#x7528;MIME&#x6765;&#x63CF;&#x8FF0;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x800C;&#x5728;MIME&#x6269;&#x5C55;&#x4E2D;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x591A;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x96C6;&#x5408;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6765;&#x5BB9;&#x7EB3;&#x591A;&#x4EFD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5728;HTTP&#x62A5;&#x6587;&#x4E2D;&#x4F7F;&#x7528;&#x591A;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x96C6;&#x5408;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x91CC;&#x52A0;&#x4E0A;Content-type&#xFF0C;&#x4F7F;&#x7528;boundary&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x5212;&#x5206;&#x591A;&#x4E0D;&#x5206;&#x5BF9;&#x8C61;&#x96C6;&#x5408;&#x6307;&#x660E;&#x7684;&#x5404;&#x7C7B;&#x5B9E;&#x4F53;&#x3002;&#x5BF9;&#x8C61;&#x96C6;&#x5408;&#x53EF;&#x53C2;&#x8003;RFC2046</p>
<h4 id="&#x83B7;&#x53D6;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7684;&#x8303;&#x56F4;&#x8BF7;&#x6C42;"><a href="#&#x83B7;&#x53D6;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7684;&#x8303;&#x56F4;&#x8BF7;&#x6C42;" class="headerlink" title="&#x83B7;&#x53D6;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7684;&#x8303;&#x56F4;&#x8BF7;&#x6C42;"></a>&#x83B7;&#x53D6;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7684;&#x8303;&#x56F4;&#x8BF7;&#x6C42;</h4><p>&#x4EE5;&#x524D;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x73B0;&#x5728;&#x7684;&#x9AD8;&#x901F;&#x5BBD;&#x5E26;&#x8BBF;&#x95EE;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x5982;&#x679C;&#x4E0B;&#x8F7D;&#x8FC7;&#x7A0B;&#x9047;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#xFF0C;&#x90A3;&#x5F97;&#x91CD;&#x5934;&#x5F00;&#x59CB;&#x3002; &#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x53EF;&#x6062;&#x590D;&#x7684;&#x673A;&#x5236;&#x3002; </p>
<p>&#x8981;&#x5B9E;&#x73B0;&#x8BE5;&#x529F;&#x80FD;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x4E0B;&#x8F7D;&#x7684;&#x5B9E;&#x4F53;&#x8303;&#x56F4;&#x3002; &#x50CF;&#x8FD9;&#x79CD;&#x6307;&#x5B9A;&#x8303;&#x56F4;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x53EB;&#x505A;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF08;Range Request&#xFF09;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF0C;&#x54CD;&#x5E94;&#x4F1A;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#x7801;&#x4E3A;206&#x7684;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x3002;</p>
<p>&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x65E0;&#x6CD5;&#x54CD;&#x5E94;&#x8303;&#x56F4;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x4F1A;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#x7801;200&#x548C;&#x5B8C;&#x6574;&#x7684;&#x5B9E;&#x4F53;&#x5185;&#x5BB9;</p>
<h4 id="&#x5185;&#x5BB9;&#x534F;&#x5546;&#x8FD4;&#x56DE;&#x6700;&#x5408;&#x9002;&#x7684;&#x5185;&#x5BB9;"><a href="#&#x5185;&#x5BB9;&#x534F;&#x5546;&#x8FD4;&#x56DE;&#x6700;&#x5408;&#x9002;&#x7684;&#x5185;&#x5BB9;" class="headerlink" title="&#x5185;&#x5BB9;&#x534F;&#x5546;&#x8FD4;&#x56DE;&#x6700;&#x5408;&#x9002;&#x7684;&#x5185;&#x5BB9;"></a>&#x5185;&#x5BB9;&#x534F;&#x5546;&#x8FD4;&#x56DE;&#x6700;&#x5408;&#x9002;&#x7684;&#x5185;&#x5BB9;</h4><p>&#x5185;&#x5BB9;&#x534F;&#x5546;&#x673A;&#x5236;&#x662F;&#x6307;&#x5BA2;&#x6237;&#x7AEF;&#x5408;&#x670D;&#x52A1;&#x7AEF;&#x5C31;&#x54CD;&#x5E94;&#x7684;&#x8D44;&#x6E90;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x4EA4;&#x6D89;&#x3001;&#x7136;&#x540E;&#x63D0;&#x4F9B;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x6700;&#x4E3A;&#x9002;&#x5408;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5185;&#x5BB9;&#x534F;&#x5546;&#x4F1A;&#x4EE5;&#x54CD;&#x5E94;&#x8D44;&#x6E90;&#x7684;&#x8BED;&#x8A00;&#x3001;&#x5B57;&#x7B26;&#x96C6;&#x3001;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x7B49;&#x4F5C;&#x4E3A;&#x5224;&#x65AD;&#x7684;&#x57FA;&#x51C6;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#x5F53;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x9ED8;&#x8BA4;&#x8BED;&#x8A00;&#x4E3A;&#x82F1;&#x8BED;&#x6216;&#x4E2D;&#x6587;&#xFF0C;&#x8BBF;&#x95EE;&#x76F8;&#x540C;&#x7684;URI&#x7684;web&#x9875;&#x9762;&#x65F6;&#xFF0C;&#x5219;&#x4F1A;&#x663E;&#x793A;&#x5BF9;&#x5E94;&#x7684;&#x82F1;&#x6587;&#x7248;&#x6216;&#x4E2D;&#x6587;&#x7248;&#x7684;Web&#x9875;&#x9762;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2018/05/09/学习笔记 ： 图解HTTP(三)/" data-id="cjh4m8hor000mfcv4mbrridut" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  
    <article id="post-学习笔记 ： 图解HTTP(一)" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2018/05/03/学习笔记 ： 图解HTTP(一)/" class="article-date">
  <time datetime="2018-05-03T06:52:26.000Z" itemprop="datePublished">2018-05-03</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>#&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP&#xFF08;&#x4E00;&#xFF09;</p>
<h2 id="&#x8F93;&#x5165;URL&#x5230;&#x7F51;&#x9875;&#x5448;&#x73B0;&#x4E2D;&#x95F4;&#x7ECF;&#x5386;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;"><a href="#&#x8F93;&#x5165;URL&#x5230;&#x7F51;&#x9875;&#x5448;&#x73B0;&#x4E2D;&#x95F4;&#x7ECF;&#x5386;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;" class="headerlink" title="&#x8F93;&#x5165;URL&#x5230;&#x7F51;&#x9875;&#x5448;&#x73B0;&#x4E2D;&#x95F4;&#x7ECF;&#x5386;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;"></a>&#x8F93;&#x5165;URL&#x5230;&#x7F51;&#x9875;&#x5448;&#x73B0;&#x4E2D;&#x95F4;&#x7ECF;&#x5386;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;</h2><p>&#x8FD8;&#x8BB0;&#x5F97;&#x4E4B;&#x524D;&#x4E0A;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8001;&#x5E08;&#x8BB2;web&#x642D;&#x5EFA;&#x7F51;&#x7AD9;&#x7684;&#x7B2C;&#x4E00;&#x8282;&#x8BFE;&#x8BF4;&#x7684;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x4E0A;&#x7F51;&#xFF0C;&#x600E;&#x4E48;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x91CC;&#x8F93;&#x5165;URL&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x60F3;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x9875;&#xFF0C; &#x6709;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x8FC7;&#xFF0C;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x5730;&#x5740;&#x680F;&#x4E2D;&#x8F93;&#x5165;URL&#x5230;&#x7F51;&#x9875;&#x5448;&#x73B0;&#x8FD9;&#x4E00;&#x4E2D;&#x95F4;&#x90FD;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;</p>
<h2 id="B-S&#x67B6;&#x6784;"><a href="#B-S&#x67B6;&#x6784;" class="headerlink" title="B/S&#x67B6;&#x6784;"></a>B/S&#x67B6;&#x6784;</h2><p>&#x5728;&#x4E86;&#x89E3;&#x7ECF;&#x8FC7;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x4E86;&#x89E3;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;B/S&#x67B6;&#x6784;&#xFF1A;<br>B/S&#x5373;&#x6D4F;&#x89C8;&#x5668;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5B83;&#x662F;&#x5BF9;C/S&#xFF08;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x7AEF;)&#x7684;&#x4E00;&#x79CD;&#x53D8;&#x5316;&#x7684;&#x7ED3;&#x6784;&#x3002; &#x5728;B/S&#x4E0B;&#xFF0C;&#x7528;&#x6237;&#x5DE5;&#x4F5C;&#x754C;&#x9762;&#x662F;&#x901A;&#x8FC7;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x6781;&#x5C11;&#x90E8;&#x5206;&#x903B;&#x8F91;&#x5728;&#x524D;&#x7AEF;&#x5B9E;&#x73B0;&#xFF0C;&#x4E3B;&#x8981;&#x903B;&#x8F91;&#x5728;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x7B80;&#x5316;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x3001;&#x7EF4;&#x62A4;&#x548C;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x51CF;&#x5C11;&#x4E86;&#x5BA2;&#x6237;&#x7AEF;&#x7535;&#x8111;&#x7684;&#x8D1F;&#x8377;&#xFF0C;&#x51CF;&#x8F7B;&#x4E86;&#x7CFB;&#x7EDF;&#x7EF4;&#x62A4;&#x4E0E;&#x5347;&#x7EA7;&#x7684;&#x6210;&#x672C;&#x548C;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x7528;&#x6237;&#x7684;&#x603B;&#x4F53;&#x6210;&#x672C;&#x3002;</p>
<h2 id="&#x7F51;&#x7EDC;&#x57FA;&#x7840;-TCP-IP"><a href="#&#x7F51;&#x7EDC;&#x57FA;&#x7840;-TCP-IP" class="headerlink" title="&#x7F51;&#x7EDC;&#x57FA;&#x7840; TCP/IP"></a>&#x7F51;&#x7EDC;&#x57FA;&#x7840; TCP/IP</h2><p>&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x7F51;&#x7EDC;&#x662F;&#x5728;TCP/IP&#x534F;&#x8BAE;&#x65CF;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FD0;&#x4F5C;&#x7684;&#x3002;&#x800C;HTTP&#x5C5E;&#x4E8E;&#x5B83;&#x5185;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#x3002;<br>&#x8BA1;&#x7B97;&#x673A;&#x4E0E;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x8981;&#x76F8;&#x4E92;&#x901A;&#x4FE1;&#xFF0C;&#x53CC;&#x65B9;&#x5C31;&#x5FC5;&#x987B;&#x57FA;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x4F55;&#x63A2;&#x6D4B;&#x5230;&#x7AE5;&#x5FC3;&#x76EE;&#x6807;&#x3001;&#x7531;&#x90A3;&#x4E00;&#x8FB9;&#x5148;&#x53D1;&#x8D77;&#x901A;&#x4FE1;&#x3001;&#x4F7F;&#x7528;&#x90A3;&#x79CD;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3001;&#x600E;&#x6837;&#x7ED3;&#x675F;&#x901A;&#x4FE1;&#x7B49;&#x89C4;&#x5219;&#x90FD;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x786E;&#x5B9A;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x89C4;&#x5219;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x5C31;&#x628A;&#x8FD9;&#x79CD;&#x89C4;&#x5219;&#x6210;&#x4E3A;&#x534F;&#x8BAE;&#xFF08;protocol&#xFF09;&#x3002;</p>
<h2 id="TCP-IP&#x7684;&#x5206;&#x5C42;&#x7BA1;&#x7406;"><a href="#TCP-IP&#x7684;&#x5206;&#x5C42;&#x7BA1;&#x7406;" class="headerlink" title="TCP/IP&#x7684;&#x5206;&#x5C42;&#x7BA1;&#x7406;"></a>TCP/IP&#x7684;&#x5206;&#x5C42;&#x7BA1;&#x7406;</h2><p>TCP/IP&#x7684;&#x534F;&#x8BAE;&#x65CF;&#x91CC;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x5206;&#x5C42;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E92;&#x8054;&#x7F51;&#x53EA;&#x7531;&#x4E00;&#x4E2A;&#x534F;&#x8BAE;&#x7EDF;&#x7B79;&#xFF0C;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x9700;&#x8981;&#x8BBE;&#x8BA1;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x628A;&#x6240;&#x6709;&#x90E8;&#x5206;&#x6574;&#x4F53;&#x66FF;&#x6362;&#x6389;&#x3002;&#x800C;&#x5206;&#x5C42;&#x4E4B;&#x540E;&#x53EA;&#x9700;&#x628A;&#x53D8;&#x52A8;&#x7684;&#x5C42;&#x66FF;&#x6362;&#x6389;&#x5373;&#x53EF;&#x3002;&#x628A;&#x9694;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x53E3;&#x90E8;&#x5206;&#x89C4;&#x5212;&#x597D;&#x4E4B;&#x540E;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C42;&#x6B21;&#x5185;&#x90E8;&#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x80FD;&#x591F;&#x81EA;&#x7531;&#x6539;&#x52A8;&#x4E86;&#x3002;</p>
<p>TCP/IP&#x534F;&#x8BAE;&#x65CF;&#x6309;&#x5C42;&#x6B21;&#x5206;&#x4E3A;4&#x5C42;&#xFF1A;</p>
<ul>
<li><p>&#x5E94;&#x7528;&#x5C42;&#xFF1A; &#x51B3;&#x5B9A;&#x4E86;&#x5411;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x65F6;&#x901A;&#x4FE1;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x6BD4;&#x5982;FTP,DNS&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E24;&#x7C7B;&#x3002; HTTP&#x534F;&#x8BAE;&#x4E5F;&#x5904;&#x4E8E;&#x8BE5;&#x5C42;</p>
</li>
<li><p>&#x4F20;&#x8F93;&#x5C42;&#xFF1A; &#x5BF9;&#x4E0A;&#x5C42;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x63D0;&#x4F9B;&#x5904;&#x4E8E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4E2D;&#x7684;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x3002; &#x5728;&#x8BE5;&#x5C42;&#x6709;&#x4E24;&#x4E2A;&#x6027;&#x8D28;&#x4E0D;&#x540C;&#x7684;&#x534F;&#x8BAE;&#xFF1A;TCP&#x3001;UDP</p>
</li>
<li><p>&#x7F51;&#x7EDC;&#x5C42;&#xFF1A; &#x7528;&#x6765;&#x5904;&#x7406;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x6D41;&#x52A8;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;&#x6570;&#x636E;&#x5305;&#x662F;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x7684;&#x6700;&#x5C0F;&#x6570;&#x636E;&#x5355;&#x4F4D;&#x3002;&#x8BE5;&#x5C42;&#x89C4;&#x5B9A;&#x4E86;&#x901A;&#x8FC7;&#x600E;&#x6837;&#x7684;&#x8DEF;&#x5F84;&#x5230;&#x8FBE;&#x5BF9;&#x65B9;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5E76;&#x628A;&#x6570;&#x636E;&#x5305;&#x4F20;&#x9001;&#x7ED9;&#x5BF9;&#x65B9;&#x3002;&#x4E0E;&#x5BF9;&#x65B9;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x591A;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x7F51;&#x7EDC;&#x8BBE;&#x522B;&#x8FDB;&#x884C;&#x4F20;&#x8F93;&#x65F6;&#xFF0C;&#x7F51;&#x7EDC;&#x5C42;&#x6240;&#x8D77;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x5728;&#x4F17;&#x591A;&#x7684;&#x9009;&#x9879;&#x5185;&#x9009;&#x62E9;&#x4E00;&#x6761;&#x4F20;&#x8F93;&#x8DEF;&#x7EBF;&#x3002;</p>
</li>
<li><p>&#x94FE;&#x8DEF;&#x5C42;&#xFF08;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#xFF09;&#xFF1A; &#x7528;&#x6765;&#x5904;&#x7406;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x7684;&#x786C;&#x4EF6;&#x90E8;&#x5206;&#x3002;&#x5305;&#x62EC;&#x63A7;&#x5236;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x786C;&#x4EF6;&#x7684;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x3001;&#x7F51;&#x5361;&#xFF0C;&#x4EE5;&#x53CA;&#x5149;&#x7EA4;&#x7B49;&#x7269;&#x7406;&#x53EF;&#x89C1;&#x90E8;&#x5206;&#x3002;&#x786C;&#x4EF6;&#x4E0A;&#x7684;&#x8303;&#x7574;&#x90FD;&#x5728;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x4F5C;&#x7528;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#x3002;</p>
</li>
</ul>
<h2 id="TCP-IP&#x901A;&#x4FE1;&#x4F20;&#x8F93;&#x6D41;"><a href="#TCP-IP&#x901A;&#x4FE1;&#x4F20;&#x8F93;&#x6D41;" class="headerlink" title="TCP/IP&#x901A;&#x4FE1;&#x4F20;&#x8F93;&#x6D41;"></a>TCP/IP&#x901A;&#x4FE1;&#x4F20;&#x8F93;&#x6D41;</h2><p>&#x4F7F;&#x7528;TCP/IP&#x534F;&#x8BAE;&#x65CF;&#x8FDB;&#x884C;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x65F6;&#xFF0C;&#x4F1A;&#x901A;&#x8FC7;&#x5206;&#x5C42;&#x987A;&#x5E8F;&#x4E0E;&#x5BF9;&#x65B9;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;&#x53D1;&#x9001;&#x7AEF;&#x4ECE;&#x5E94;&#x7528;&#x5C42;&#x5F80;&#x4E0B;&#x8D70;&#xFF0C;&#x63A5;&#x6536;&#x7AEF;&#x5219;&#x5411;&#x5E94;&#x7528;&#x5C42;&#x5F80;&#x4E0A;&#x8D70;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x5BA2;&#x6237;&#x7B97;&#x901A;&#x8FC7;HTTP&#x534F;&#x8BAE;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x60F3;&#x770B;&#x67D0;&#x4E2A;web&#x9875;&#x9762;&#x7684;HTTP&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x63A5;&#x7740;&#xFF0C;&#x4E3A;&#x4E86;&#x4F20;&#x8F93;&#x65B9;&#x4FBF;&#xFF0C;&#x5728;&#x4F20;&#x8F93;&#x5C42;&#xFF08;TCP&#xFF09;&#x628A;&#x4ECE;&#x5E94;&#x7528;&#x5C42;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x5272;&#xFF0C;&#x5E76;&#x5728;&#x5404;&#x4E2A;&#x62A5;&#x6587;&#x4E0A;&#x6253;&#x4E0A;&#x6807;&#x8BB0;&#x5E8F;&#x53F7;&#x53CA;&#x7AEF;&#x53E3;&#x53F7;&#x540E;&#x8F6C;&#x53D1;&#x7ED9;&#x7F51;&#x7EDC;&#x5C42;&#x3002;</p>
<p>&#x5728;&#x7F51;&#x7EDC;&#x5C42;&#xFF08;IP&#x534F;&#x8BAE;&#xFF09;&#xFF0C;&#x589E;&#x52A0;&#x4F5C;&#x4E3A;&#x901A;&#x4FE1;&#x76EE;&#x7684;&#x5730;&#x7684;MAC&#x5730;&#x5740;&#x540E;&#x8F6C;&#x53D1;&#x7ED9;&#x94FE;&#x8DEF;&#x5C42;&#x3002;</p>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x53D1;&#x5F80;&#x670D;&#x52A1;&#x5668;&#x7684;&#x901A;&#x4FE1;&#x8BF7;&#x6C42;&#x5C31;&#x51C6;&#x5907;&#x9F50;&#x5168;&#x4E86;&#x3002; </p>
<p>&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5728;&#x94FE;&#x8DEF;&#x5C42;&#x63A5;&#x6536;&#x5230;&#x6570;&#x636E;&#xFF0C;&#x6309;&#x5E8F;&#x5F80;&#x4E0A;&#x5C42;&#x53D1;&#x9001;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x5E94;&#x7528;&#x5C42;&#x3002;&#x5F53;&#x4F20;&#x8F93;&#x5230;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x624D;&#x80FD;&#x7B97;&#x771F;&#x6B63;&#x63A5;&#x6536;&#x5230;&#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x8FC7;&#x6765;&#x7684;HTTP&#x8BF7;&#x6C42;&#x3002;</p>
<p><img src="/2018/05/03/&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x4E00;)/HTTP1.jpeg" alt="HTTP1"></p>
<h2 id="&#x786E;&#x4FDD;&#x53EF;&#x9760;&#x6027;&#x7684;TCP&#x534F;&#x8BAE;"><a href="#&#x786E;&#x4FDD;&#x53EF;&#x9760;&#x6027;&#x7684;TCP&#x534F;&#x8BAE;" class="headerlink" title="&#x786E;&#x4FDD;&#x53EF;&#x9760;&#x6027;&#x7684;TCP&#x534F;&#x8BAE;"></a>&#x786E;&#x4FDD;&#x53EF;&#x9760;&#x6027;&#x7684;TCP&#x534F;&#x8BAE;</h2><p>&#x6309;&#x5C42;&#x6B21;&#x5206;&#xFF0C;TCP&#x4F4D;&#x4E8E;&#x4F20;&#x8F93;&#x5C42;&#xFF0C;&#x63D0;&#x4F9B;&#x53EF;&#x9760;&#x7684;&#x5B57;&#x8282;&#x6D41;&#x670D;&#x52A1;&#xFF0C;&#x4E3A;&#x4E86;&#x4F20;&#x8F93;&#x65B9;&#x4FBF;&#xFF0C;&#x5C06;&#x5927;&#x5757;&#x6570;&#x636E;&#x5206;&#x5272;&#x6210;&#x4EE5;&#x62A5;&#x6587;&#x6BB5;&#xFF08;segment&#xFF09;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x6570;&#x636E;&#x5305;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;&#x800C;&#x53EF;&#x9760;&#x7684;&#x4F20;&#x8F93;&#x670D;&#x52A1;&#x662F;&#x6307;&#xFF0C;&#x80FD;&#x591F;&#x628A;&#x6570;&#x636E;&#x4F20;&#x7ED9;&#x5BF9;&#x65B9;,&#x5E76;&#x80FD;&#x591F;&#x786E;&#x8BA4;&#x6570;&#x636E;&#x6700;&#x7EC8;&#x662F;&#x5426;&#x9001;&#x8FBE;&#x5230;&#x5BF9;&#x65B9;&#xFF08;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF09;&#x3002;</p>
<h3 id="&#x4E09;&#x6B21;&#x63E1;&#x624B;"><a href="#&#x4E09;&#x6B21;&#x63E1;&#x624B;" class="headerlink" title="&#x4E09;&#x6B21;&#x63E1;&#x624B;"></a>&#x4E09;&#x6B21;&#x63E1;&#x624B;</h3><p>&#x7528;TCP&#x534F;&#x8BAE;&#x628A;&#x6570;&#x636E;&#x5305;&#x9001;&#x51FA;&#x53BB;&#x540E;&#xFF0C;TCP&#x4E0D;&#x4F1A;&#x5BF9;&#x4F20;&#x9001;&#x540E;&#x7684;&#x52E4;&#x5FEB;&#x7F6E;&#x4E4B;&#x4E0D;&#x7406;&#xFF0C;&#x5B83;&#x4E00;&#x5B9A;&#x4F1A;&#x5411;&#x5BF9;&#x65B9;&#x786E;&#x8BA4;&#x662F;&#x5426;&#x6210;&#x529F;&#x9001;&#x8FBE;&#x3002;</p>
<p>&#x53D1;&#x9001;&#x7AEF;&#x9996;&#x5148;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5E26;SYN&#x6807;&#x5FD7;&#x7684;&#x6570;&#x636E;&#x5305;&#x7ED9;&#x5BF9;&#x65B9;&#x3002;&#x63A5;&#x6536;&#x7AEF;&#x6536;&#x5230;&#x540E;&#xFF0C;&#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x5E26;&#x6709;SYN/ACK&#x6807;&#x5FD7;&#x7684;&#x6570;&#x636E;&#x5305;&#x4EE5;&#x4F20;&#x8FBE;&#x786E;&#x8BA4;&#x4FE1;&#x606F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x518D;&#x56DE;&#x4F20;&#x4E00;&#x4E2A;&#x5E26;ACK&#x6807;&#x5FD7;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4EE3;&#x8868;&#x201D;&#x63E1;&#x624B;&#x201D;&#x7ED3;&#x675F;&#x3002; &#x5982;&#x679C;&#x5728;&#x63E1;&#x624B;&#x8FC7;&#x7A0B;&#x4E2D;&#x67D0;&#x4E2A;&#x9636;&#x6BB5;&#x7EC8;&#x7AEF;&#xFF0C;TCP&#x534F;&#x8BAE;&#x4F1A;&#x518D;&#x6B21;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x53D1;&#x9001;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;</p>
<p><img src="/2018/05/03/&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x4E00;)/HTTP2.jpeg" alt=""></p>
<h3 id="WEB&#x9875;&#x9762;&#x7684;&#x5448;&#x73B0;"><a href="#WEB&#x9875;&#x9762;&#x7684;&#x5448;&#x73B0;" class="headerlink" title="WEB&#x9875;&#x9762;&#x7684;&#x5448;&#x73B0;"></a>WEB&#x9875;&#x9762;&#x7684;&#x5448;&#x73B0;</h3><p><img src="/2018/05/03/&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x4E00;)/HTTP3.jpeg" alt="HTTP3"></p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2018/05/03/学习笔记 ： 图解HTTP(一)/" data-id="cjh4m8hom000kfcv4oyo49c7w" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  
    <article id="post-学习笔记 ： 图解HTTP(二)" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2018/05/03/学习笔记 ： 图解HTTP(二)/" class="article-date">
  <time datetime="2018-05-03T06:51:43.000Z" itemprop="datePublished">2018-05-03</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>#&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP&#x4E8C;&#x3001;&#x7B80;&#x5355;&#x7684;HTTP&#x534F;&#x8BAE;</p>
<h2 id="HTTP&#x6982;&#x8FF0;"><a href="#HTTP&#x6982;&#x8FF0;" class="headerlink" title="HTTP&#x6982;&#x8FF0;"></a>HTTP&#x6982;&#x8FF0;</h2><p>HTTP&#x534F;&#x8BAE;&#x5408;TCP/IP&#x534F;&#x8BAE;&#x65CF;&#x5185;&#x7684;&#x5176;&#x4ED6;&#x4F17;&#x591A;&#x534F;&#x8BAE;&#x76F8;&#x540C;&#xFF0C;&#x7528;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x3002;&#x4ECE;&#x5BA2;&#x6237;&#x7B97;&#x5F00;&#x59CB;&#x5EFA;&#x7ACB;&#x901A;&#x4FE1;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x5728;&#x6CA1;&#x6709;&#x63A5;&#x6536;&#x5230;&#x8BF7;&#x6C42;&#x4E4B;&#x524D;&#x4E0D;&#x4F1A;&#x53D1;&#x9001;&#x54CD;&#x5E94;&#x3002;</p>
<h3 id="&#x8BF7;&#x6C42;&#x62A5;&#x6587;"><a href="#&#x8BF7;&#x6C42;&#x62A5;&#x6587;" class="headerlink" title="&#x8BF7;&#x6C42;&#x62A5;&#x6587;"></a>&#x8BF7;&#x6C42;&#x62A5;&#x6587;</h3><p>&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x662F;&#x7531;&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#x3001;&#x8BF7;&#x6C42;URI&#x3001;&#x534F;&#x8BAE;&#x7248;&#x672C;&#x3001;&#x53EF;&#x9009;&#x7684;&#x8BF7;&#x6C42;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x548C;&#x5185;&#x5BB9;&#x5B9E;&#x4F53;&#x6784;&#x6210;&#x3002;</p>
<p><img src="/2018/05/03/&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x4E8C;)/HTTP2-1.jpeg" alt="HTTP2"></p>
<h3 id="&#x54CD;&#x5E94;&#x62A5;&#x6587;"><a href="#&#x54CD;&#x5E94;&#x62A5;&#x6587;" class="headerlink" title="&#x54CD;&#x5E94;&#x62A5;&#x6587;"></a>&#x54CD;&#x5E94;&#x62A5;&#x6587;</h3><p>&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x57FA;&#x672C;&#x4E0A;&#x7531;&#x534F;&#x8BAE;&#x7248;&#x672C;&#x3001;&#x72B6;&#x6001;&#x7801;&#x3001;&#x7528;&#x4EE5;&#x89E3;&#x91CA;&#x72B6;&#x6001;&#x7801;&#x7684;&#x539F;&#x56E0;&#x77ED;&#x8BED;&#x3001;&#x53EF;&#x9009;&#x7684;&#x54CD;&#x5E94;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x4EE5;&#x53CA;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x6784;&#x6210;&#x3002;<br><img src="/2018/05/03/&#x5B66;&#x4E60;&#x7B14;&#x8BB0; &#xFF1A; &#x56FE;&#x89E3;HTTP(&#x4E8C;)/HTTP2-2.jpeg" alt="HTTP3"></p>
<h2 id="HTTP&#x662F;&#x4E0D;&#x4FDD;&#x5B58;&#x72B6;&#x6001;&#x7684;&#x534F;&#x8BAE;"><a href="#HTTP&#x662F;&#x4E0D;&#x4FDD;&#x5B58;&#x72B6;&#x6001;&#x7684;&#x534F;&#x8BAE;" class="headerlink" title="HTTP&#x662F;&#x4E0D;&#x4FDD;&#x5B58;&#x72B6;&#x6001;&#x7684;&#x534F;&#x8BAE;"></a>HTTP&#x662F;&#x4E0D;&#x4FDD;&#x5B58;&#x72B6;&#x6001;&#x7684;&#x534F;&#x8BAE;</h2><p>HTTP&#x662F;&#x65E0;&#x72B6;&#x6001;&#x534F;&#x8BAE;&#xFF0C;&#x81EA;&#x8EAB;&#x4E0D;&#x5BF9;&#x8BF7;&#x6C42;&#x5408;&#x54CD;&#x5E94;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x72B6;&#x6001;&#x8FDB;&#x884C;&#x4FDD;&#x5B58;&#x3002;&#x4F7F;&#x7528;HTTP&#x534F;&#x8BAE;&#xFF0C;&#x6BCF;&#x5F53;&#x6709;&#x65B0;&#x7684;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x65B0;&#x54CD;&#x5E94;&#x4EA7;&#x751F;&#x3002;&#x534F;&#x8BAE;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x4FDD;&#x7559;&#x4E4B;&#x524D;&#x4E00;&#x5207;&#x7684;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x5FEB;&#x5730;&#x5904;&#x7406;&#x5927;&#x91CF;&#x5931;&#x8BEF;&#xFF0C;&#x786E;&#x4FDD;&#x534F;&#x8BAE;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#xFF0C;&#x800C;&#x7279;&#x610F;&#x628A;HTTP&#x534F;&#x8BAE;&#x8BBE;&#x8BA1;&#x6210;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x7684;&#x3002;</p>
<p>&#x53EF;&#x662F;&#x65E0;&#x72B6;&#x6001;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x4E1A;&#x52A1;&#x5904;&#x7406;&#x6709;&#x65F6;&#x5F88;&#x68D8;&#x624B;&#xFF0C;&#x6BD4;&#x5982;&#x5E38;&#x89C1;&#x793E;&#x4EA4;&#x7F51;&#x7AD9;&#x7684;&#x7528;&#x6237;&#x767B;&#x5F55;&#x6001;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x7EF4;&#x62A4;&#x72B6;&#x6001;&#xFF0C;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x90FD;&#x9700;&#x8981;&#x7528;&#x6237;&#x53BB;&#x767B;&#x5F55;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F15;&#x5165;&#x4E86;cookie&#x6280;&#x672F;&#x7528;&#x4EE5;&#x5B9E;&#x73B0;&#x4FDD;&#x6301;&#x7528;&#x6237;&#x6001;&#x7684;&#x95EE;&#x9898;&#x3002;cookie&#x4F1A;&#x6839;&#x636E;&#x4ECE;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x54CD;&#x5E94;&#x62A5;&#x6587;&#x5185;&#x7684;&#x4E00;&#x4E2A;&#x53EB;&#x505A;Set-Cookie&#x7684;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x4FE1;&#x606F;&#xFF0C;&#x901A;&#x77E5;&#x5BA2;&#x6237;&#x7AEF;&#x4FDD;&#x5B58;Cookie&#x3002;&#x5F53;&#x4E0B;&#x6B21;&#x5BA2;&#x6237;&#x7AEF;&#x518D;&#x5F80;&#x8BE5;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4F1A;&#x81EA;&#x52A8;&#x5728;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x4E2D;&#x52A0;&#x5165;Cookie&#x503C;&#x540E;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x3002;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x53D1;&#x73B0;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x8FC7;&#x6765;Cookie&#x540E;&#xFF0C;&#x4F1A;&#x53BB;&#x68C0;&#x67E5;&#x7A76;&#x7ADF;&#x662F;&#x4ECE;&#x54EA;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x6765;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6BD4;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="&#x670D;&#x52A1;&#x5668;&#x610F;&#x56FE;&#x7684;HTTP&#x65B9;&#x6CD5;"><a href="#&#x670D;&#x52A1;&#x5668;&#x610F;&#x56FE;&#x7684;HTTP&#x65B9;&#x6CD5;" class="headerlink" title="&#x670D;&#x52A1;&#x5668;&#x610F;&#x56FE;&#x7684;HTTP&#x65B9;&#x6CD5;"></a>&#x670D;&#x52A1;&#x5668;&#x610F;&#x56FE;&#x7684;HTTP&#x65B9;&#x6CD5;</h2><ul>
<li><p>GET: &#x83B7;&#x53D6;&#x8D44;&#x6E90;</p>
<p>  GET&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x8981;&#x6C42;&#x8BBF;&#x95EE;&#x5DF2;&#x88AB;URI&#x8BC6;&#x522B;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x6307;&#x5B9A;&#x7684;&#x8D44;&#x6E90;&#x7ECF;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x89E3;&#x6790;&#x540E;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#x5185;&#x5BB9;&#x3002;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x7684;&#x662F;&#x6587;&#x672C;&#xFF0C;&#x5219;&#x4FDD;&#x6301;&#x539F;&#x6837;&#x8FD4;&#x56DE;&#xFF1B;&#x5982;&#x679C;&#x662F;&#x50CF;CGI(&#x901A;&#x7528;&#x7F51;&#x5173;&#x63A5;&#x53E3;)&#x90A3;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x7ECF;&#x8FC7;&#x6267;&#x884C;&#x540E;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p>
</li>
<li><p>POST: &#x4F20;&#x8F93;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;</p>
<p>  POST&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x4F20;&#x8F93;&#x5B9E;&#x4F53;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x867D;&#x7136;GET&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x4E00;&#x822C;&#x4E0D;&#x7528;GET&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4F20;&#x8F93;&#x3002; &#x867D;&#x8BF4;&#x529F;&#x80FD;&#x548C;GET&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;POST&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x83B7;&#x53D6;&#x54CD;&#x5E94;&#x7684;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x3002;</p>
</li>
<li><p>PUT: &#x4F20;&#x8F93;&#x6587;&#x4EF6;</p>
<p>  PUT&#x7528;&#x6765;&#x4F20;&#x8F93;&#x6587;&#x4EF6;&#xFF0C;&#x8981;&#x6C42;&#x5728;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x7684;&#x4E3B;&#x9898;&#x4E2D;&#x5305;&#x542B;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#xFF0C;&#x7136;&#x540E;&#x4FDD;&#x5B58;&#x5230;&#x8BF7;&#x6C42;URI&#x6307;&#x5B9A;&#x7684;&#x4F4D;&#x7F6E;&#x3002;PUT&#x81EA;&#x8EAB;&#x4E0D;&#x5E26;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#xFF0C;&#x5B58;&#x5728;&#x5B89;&#x5168;&#x6027;&#x95EE;&#x9898;&#x3002;&#x82E5;&#x914D;&#x5408;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9A8C;&#x8BC1;&#x673A;&#x667A;&#xFF0C;&#x6216;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x91C7;&#x7528;REST&#x6807;&#x51C6;&#x7684;&#x540C;&#x7C7B;Web&#x7F51;&#x7AD9;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x5F00;&#x653E;&#x4F7F;&#x7528;PUT&#x65B9;&#x6CD5;&#x3002;</p>
</li>
<li><p>HEAD: &#x83B7;&#x5F97;&#x62A5;&#x6587;&#x9996;&#x90E8;</p>
<p>  HEAD&#x65B9;&#x6CD5;&#x548C;GET&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x8FD4;&#x56DE;&#x62A5;&#x6587;&#x4E3B;&#x4F53;&#x90E8;&#x5206;&#x3002;&#x7528;&#x4E8E;&#x786E;&#x8BA4;URI&#x7684;&#x6709;&#x6548;&#x6027;&#x53CA;&#x8D44;&#x6E90;&#x66F4;&#x65B0;&#x7684;&#x65E5;&#x671F;&#x65F6;&#x95F4;&#x7B49;&#x3002;</p>
</li>
<li><p>DELETE: &#x5220;&#x9664;&#x6587;&#x4EF6;</p>
<p>  Delete&#x7528;&#x6765;&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF0C;&#x662F;&#x4E0E;PUT&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6309;&#x8BF7;&#x6C42;URI&#x5220;&#x9664;&#x6307;&#x5B9A;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x4F46;&#x662F;HTTP/1.1&#x7684;DELETE&#x65B9;&#x6CD5;&#x672C;&#x8EAB;&#x548C;PUT&#x65B9;&#x6CD5;&#x4E00;&#x6837;&#x4E0D;&#x5E26;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;Web&#x4E5F;&#x4E0D;&#x4F7F;&#x7528;&#x3002;&#x5F53;&#x914D;&#x5408;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9A8C;&#x8BC1;&#x673A;&#x5236;&#xFF0C;&#x6216;&#x9075;&#x5B88;REST&#x6807;&#x51C6;&#x8FD8;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5F00;&#x653E;&#x4F7F;&#x7528;&#x7684;&#x3002; </p>
</li>
</ul>
<h2 id="&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x8282;&#x7701;&#x901A;&#x4FE1;&#x91CF;"><a href="#&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x8282;&#x7701;&#x901A;&#x4FE1;&#x91CF;" class="headerlink" title="&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x8282;&#x7701;&#x901A;&#x4FE1;&#x91CF;"></a>&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x8282;&#x7701;&#x901A;&#x4FE1;&#x91CF;</h2><p>HTTP&#x534F;&#x8BAE;&#x7684;&#x521D;&#x59CB;&#x7248;&#x672C;&#xFF0C;&#x6BCF;&#x8FDB;&#x884C;&#x4E00;&#x6B21;HTTP&#x901A;&#x4FE1;&#x5C31;&#x8981;TCP&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x5408;&#x65AD;&#x5F00;&#xFF0C;&#x4F1A;&#x589E;&#x52A0;&#x901A;&#x4FE1;&#x91CF;&#x7684;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;TCP&#x8FDE;&#x63A5;&#x7684;&#x95EE;&#x9898;&#x5C31;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#xFF08;kept-alive&#xFF09;&#xFF0C;&#x7279;&#x70B9;&#x662F;&#x53EA;&#x8981;&#x4EFB;&#x610F;&#x4E00;&#x7AEF;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x63D0;&#x51FA;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#xFF0C;&#x5219;&#x4FDD;&#x6301;TCP&#x8FDE;&#x63A5;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x7684;&#x597D;&#x5904;u&#x5728;&#x4E8E;&#x51CF;&#x5C11;&#x4E86;TCP&#x7684;&#x94FE;&#x63A5;&#x7684;&#x91CD;&#x590D;&#x5EFA;&#x7ACB;&#x548C;&#x65AD;&#x5F00;&#x6240;&#x9020;&#x6210;&#x7684;&#x989D;&#x5916;&#x5F00;&#x9500;&#xFF0C;&#x51CF;&#x8F7B;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x8D1F;&#x8F7D;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x51CF;&#x5C11;&#x5F00;&#x9500;&#x7684;&#x90A3;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#xFF0C;&#x4F7F;HTTP&#x8BF7;&#x6C42;&#x5408;&#x54CD;&#x5E94;&#x80FD;&#x66F4;&#x65E9;&#x5730;&#x7ED3;&#x675F;&#xFF0C;&#x8FD9;&#x6837;Web&#x9875;&#x9762;&#x7684;&#x663E;&#x793A;&#x901F;&#x5EA6;&#x4E5F;&#x5C31;&#x76F8;&#x5E94;&#x63D0;&#x9AD8;&#x4E86;&#x3002;</p>
<p>&#x5728;HTTP/1.1&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x94FE;&#x63A5;&#x9ED8;&#x8BA4;&#x90FD;&#x662F;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x5728;HTTP/1.0&#x5185;&#x5E76;&#x672A;&#x6807;&#x51C6;&#x5316;&#x3002;&#x7D22;&#x7136;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x670D;&#x52A1;&#x5668;&#x901A;&#x8FC7;&#x975E;&#x6807;&#x51C6;&#x7684;&#x624B;&#x6BB5;&#x5B9E;&#x73B0;&#x4E86;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x652F;&#x6301;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x3002;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x51FA;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4E5F;&#x9700;&#x8981;&#x652F;&#x6301;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x3002;</p>
<h2 id="&#x7BA1;&#x7EBF;&#x5316;"><a href="#&#x7BA1;&#x7EBF;&#x5316;" class="headerlink" title="&#x7BA1;&#x7EBF;&#x5316;"></a>&#x7BA1;&#x7EBF;&#x5316;</h2><p>&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x4F7F;&#x5F97;&#x591A;&#x6570;&#x8BF7;&#x6C42;&#x4EE5;&#x7BA1;&#x7EBF;&#x5316;&#x65B9;&#x5F0F;&#x53D1;&#x9001;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002; &#x7BA1;&#x7EBF;&#x5316;&#x6280;&#x672F;&#x51FA;&#x73B0;&#x540E;&#xFF0C;&#x4E0D;&#x7528;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#x4E5F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x591F;&#x505A;&#x5230;&#x901A;&#x8FC7;&#x5E76;&#x884C;&#x53D1;&#x9001;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x5730;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#x4E86;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2018/05/03/学习笔记 ： 图解HTTP(二)/" data-id="cjh4m8how000pfcv44hvjjox6" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  
    <article id="post-另使用target action" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2018/04/19/另使用target action/" class="article-date">
  <time datetime="2018-04-19T11:10:56.000Z" itemprop="datePublished">2018-04-19</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="&#x53E6;&#x4F7F;&#x7528;target-action"><a href="#&#x53E6;&#x4F7F;&#x7528;target-action" class="headerlink" title="&#x53E6;&#x4F7F;&#x7528;target action"></a>&#x53E6;&#x4F7F;&#x7528;target action</h2><p>&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x9075;&#x5FAA;MVC&#x6216;&#x8005;MVC&#x884D;&#x751F;&#x51FA;&#x7684;&#x6846;&#x67B6;&#x7684;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#x6240;&#x6709;&#x7684;&#x89C6;&#x56FE;&#x64CD;&#x4F5C;&#x90FD;&#x653E;&#x5728;V&#x91CC;&#x9762;&#xFF0C; &#x9875;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x7684;&#x5904;&#x7406;&#x903B;&#x8F91;&#x8FD8;&#x9700;&#x8981;&#x901A;&#x8FC7;C&#x6765;&#x534F;&#x8C03;&#x3002; iOS&#x91CC;&#x9762;&#x6709;&#x63D0;&#x4F9B;&#x8BF8;&#x5982;Target-Action,Delegate,Block&#x7B49;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002; &#x5BF9;&#x4E00;&#x822C;&#x53EA;&#x8981;&#x4E00;&#x4E24;&#x4E2A;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x4F7F;&#x7528;block&#x6765;&#x8FDB;&#x884C;&#x56DE;&#x6389;&#x3002; &#x5982;&#x679C;&#x4E00;&#x65E6;&#x6570;&#x91CF;&#x6709;&#x70B9;&#x591A;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x6709;&#x70B9;&#x4E0D;&#x96C5;&#x89C2;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#x50CF;&#x4E0B;&#x56FE;&#x8FD9;&#x6837;<br><img src="/2018/04/19/&#x53E6;&#x4F7F;&#x7528;target action/image2.jpeg" alt="Image1"><br><img src="/2018/04/19/&#x53E6;&#x4F7F;&#x7528;target action/image1.jpeg" alt="Image2"></p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;IMP&#x53BB;&#x6267;&#x884C;&#x51FD;&#x6570;&#x8C03;&#x7528; &#x53EF;&#x80FD;&#x770B;&#x4E0A;&#x53BB;&#x4F1A;&#x66F4;&#x4F18;&#x96C5;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5728;View&#x4E2D;&#x58F0;&#x660E;target&#x548C;action<br><img src="/2018/04/19/&#x53E6;&#x4F7F;&#x7528;target action/image3.jpeg" alt="Image2"></p>
<p>&#x521D;&#x59CB;&#x5316;View&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x8D4B;&#x503C;<br><img src="/2018/04/19/&#x53E6;&#x4F7F;&#x7528;target action/image4.jpeg" alt="Image2"></p>
<p>&#x5728;View&#x4E2D;&#x6DFB;&#x52A0;&#x5BF9;&#x5E94;&#x7684;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;<br><img src="/2018/04/19/&#x53E6;&#x4F7F;&#x7528;target action/image5.jpeg" alt="Image2"><br>&#x901A;&#x8FC7;&#x51FD;&#x6570;&#x6307;&#x9488;&#x76F4;&#x63A5;&#x53EF;&#x4EE5;&#x5728;target&#x4E5F;&#x5C31;&#x662F;VC&#x4E2D;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x4E86;&#x3002;<br><img src="/2018/04/19/&#x53E6;&#x4F7F;&#x7528;target action/image6.jpeg" alt="Image2"></p>
<h2 id="IMP"><a href="#IMP" class="headerlink" title="IMP"></a>IMP</h2><pre><code>typedef id (*IMP)(id, SEL, ...);
</code></pre><p>IMP&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6307;&#x9488;&#xFF0C;&#x5B83;&#x6307;&#x5411;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x7684;&#x9996;&#x5730;&#x5740;&#x3002;&#x901A;&#x8FC7;&#x83B7;&#x53D6;IMP&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x6267;&#x884C;IMP&#x6307;&#x5411;&#x7684;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x662F;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x51FD;&#x6570;&#x6307;&#x9488;</p>
<pre><code>void (*function) (id, SEL, NSInteger) = (void*)imp;
</code></pre><p>&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x5B9E;&#x73B0;</p>
<pre><code>function (self.target, self.action, type);
</code></pre>
      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2018/04/19/另使用target action/" data-id="cjh4m8hoi000ifcv4zrix8v5m" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  
    <article id="post-从ReactNative源码中看Runtime消息转发" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2017/11/29/从ReactNative源码中看Runtime消息转发/" class="article-date">
  <time datetime="2017-11-29T06:17:38.000Z" itemprop="datePublished">2017-11-29</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2017/11/29/从ReactNative源码中看Runtime消息转发/">从ReactNative源码中看Runtime消息转发</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        
      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2017/11/29/从ReactNative源码中看Runtime消息转发/" data-id="cjh4m8hoh000gfcv4akbgungf" class="article-share-link">Share</a>
      
      
    </footer>
  </div>
  
</article>


  
    <article id="post-把ReactNative的图片加载框架替换成SDWebImage" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2017/10/28/把ReactNative的图片加载框架替换成SDWebImage/" class="article-date">
  <time datetime="2017-10-28T09:31:34.000Z" itemprop="datePublished">2017-10-28</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2017/10/28/把ReactNative的图片加载框架替换成SDWebImage/">把ReactNative的图片加载框架替换成SDWebImage</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x521A;&#x63A5;&#x89E6;RN&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x60F3;&#x63A5;&#x5165;RN&#x7684;&#x8BDD;&#x56FE;&#x7247;&#x7684;&#x7F13;&#x5B58;&#x903B;&#x8F91;&#x8981;&#x7EF4;&#x62A4;&#x4E24;&#x5957;&#x5E76;&#x4E14;&#x7F13;&#x5B58;&#x4E0D;&#x80FD;&#x5171;&#x4EAB;&#xFF0C; &#x5FC3;&#x91CC;&#x5600;&#x5495;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x66FF;&#x6362;&#x6210;native&#x7AEF;&#x7684;SDWebImage&#x53BB;&#x4E0B;&#x8F7D;&#x3001;&#x7F13;&#x5B58;&#x3002;&#x5F97;&#x76CA;&#x4E8E;RN&#x5F3A;&#x5927;&#x7684;&#x7EC4;&#x4EF6;&#x5316;&#x80FD;&#x529B;&#x4EE5;&#x53CA;&#x826F;&#x597D;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x4EC5;&#x4EC5;&#x52A0;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x3002;<br></p>
        
          <p class="article-more-link">
            <a href="/2017/10/28/把ReactNative的图片加载框架替换成SDWebImage/#more">Read More</a>
          </p>
        
      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2017/10/28/把ReactNative的图片加载框架替换成SDWebImage/" data-id="cjh4m8hoz000sfcv4drm59pu7" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/ReactNative-SDWebImage/">ReactNative,SDWebImage</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-ReactNative之RCTImage图片框架" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2017/10/01/ReactNative之RCTImage图片框架/" class="article-date">
  <time datetime="2017-10-01T09:19:01.000Z" itemprop="datePublished">2017-10-01</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2017/10/01/ReactNative之RCTImage图片框架/">ReactNative之RCTImage图片加载框架源码解析</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>RN&#x7684;&#x56FE;&#x7247;&#x52A0;&#x8F7D;&#x63A7;&#x4EF6;&#x662F;image&#xFF0C;&#x53EF;&#x4EE5;&#x52A0;&#x8F7D;&#x672C;&#x5730;&#x548C;&#x8FDC;&#x7A0B;&#x56FE;&#x7247;&#xFF0C;&#x76F4;&#x63A5;&#x8BBE;&#x7F6E;source&#x5C31;&#x53EF;&#x4EE5;&#x663E;&#x793A;&#x56FE;&#x7247;&#xFF0C;&#x901A;&#x8FC7;&#x6E90;&#x7801;&#x770B;&#x4E00;&#x4E0B;&#x5185;&#x90E8;&#x662F;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#xFF08;&#x57FA;&#x4E8E;0.48&#xFF0C;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x53EF;&#x80FD;&#x6709;&#x5DEE;&#x5F02;&#xFF09;</p>
        
          <p class="article-more-link">
            <a href="/2017/10/01/ReactNative之RCTImage图片框架/#more">Read More</a>
          </p>
        
      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2017/10/01/ReactNative之RCTImage图片框架/" data-id="cjh4m8hn40002fcv4924d6o96" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/ReactNative/">ReactNative</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-ReactNative源码分析" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2017/09/25/ReactNative源码分析/" class="article-date">
  <time datetime="2017-09-25T06:33:40.000Z" itemprop="datePublished">2017-09-25</time>
</a>
    
  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2017/09/25/ReactNative源码分析/">ReactNative源码分析</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x9879;&#x76EE;&#x4E2D;&#x7528;&#x5230;&#x4E86;ReactNative,&#x82B1;&#x4E86;&#x70B9;&#x65F6;&#x95F4;&#x770B;&#x4E86;&#x4E0B;&#x6E90;&#x7801;&#xFF0C;&#x4EC5;&#x505A;&#x4E2A;&#x4EBA;&#x7B14;&#x8BB0;&#x7528;&#x3002;<br></p>
        
          <p class="article-more-link">
            <a href="/2017/09/25/ReactNative源码分析/#more">Read More</a>
          </p>
        
      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2017/09/25/ReactNative源码分析/" data-id="cjh4m8hnf0004fcv4dscbu9xa" class="article-share-link">Share</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/ReactNative/">ReactNative</a></li></ul>

    </footer>
  </div>
  
</article>


  


  <nav id="page-nav">
    <span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="extend next" rel="next" href="/page/2/">__('next') &raquo;</a>
  </nav>
</section>
        
          <aside id="sidebar">
  
    

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/AFNetworking/">AFNetworking</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/Block/">Block</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/CocoaPods/">CocoaPods</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/ReactNative/">ReactNative</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/ReactNative-SDWebImage/">ReactNative,SDWebImage</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/AFNetworking/" style="font-size: 10px;">AFNetworking</a> <a href="/tags/Block/" style="font-size: 10px;">Block</a> <a href="/tags/CocoaPods/" style="font-size: 10px;">CocoaPods</a> <a href="/tags/ReactNative/" style="font-size: 20px;">ReactNative</a> <a href="/tags/ReactNative-SDWebImage/" style="font-size: 10px;">ReactNative,SDWebImage</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/05/">May 2018</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/04/">April 2018</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/11/">November 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/10/">October 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/09/">September 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/04/">April 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">February 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">November 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">October 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">September 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">August 2016</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/07/">July 2015</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2015/05/">May 2015</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2018/05/11/学习笔记 ： 图解HTTP(五)/">(no title)</a>
          </li>
        
          <li>
            <a href="/2018/05/10/学习笔记 ： 图解HTTP(四)/">(no title)</a>
          </li>
        
          <li>
            <a href="/2018/05/09/学习笔记 ： 图解HTTP(三)/">(no title)</a>
          </li>
        
          <li>
            <a href="/2018/05/03/学习笔记 ： 图解HTTP(一)/">(no title)</a>
          </li>
        
          <li>
            <a href="/2018/05/03/学习笔记 ： 图解HTTP(二)/">(no title)</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2018 Moyun<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>